tap "homebrew/cask-fonts"

# Shell
brew "fish"
brew "z"
brew "zoxide"
brew "fzf"

# CLI tools
brew "eza"
brew "bat"
brew "ripgrep"
brew "tldr"
brew "tree"
brew "git-delta"
brew "gh"
brew "pre-commit"
brew "navi"
brew "csvlens"

# Editors / TUI
brew "neovim"
brew "helix"
brew "lazygit"
brew "yazi"
brew "zellij"
brew "tmux"

# System monitoring
brew "zenith"

# Dev runtimes
brew "go"
brew "node"
brew "nvm"
brew "rbenv"
brew "ruby"
brew "python@3.13"

# Misc dev
brew "prettier"
brew "watchman"

# Casks
cask "kitty"
cask "alt-tab"
cask "visual-studio-code"
cask "postman"

# Fonts
cask "font-daddy-time-mono-nerd-font"
